clear, clc;
M = 3;% = 5 % количество элементов решетки (номер элемента)
N = 16 % = 10; % количество выборок (номер выборки)
Q = 10000; % количество экспериментов
r = 120; % количество отрезков для разбиения (см. hist)

L = zeros (Q, 1);
L_abs = zeros (Q, 1);
L_real = zeros (Q, 1);

for q = 1:1:Q
    A = zeros (M, M);
    for n = 1:1:N
        x = randn(M, 1);
        y = randn(M, 1);
        z = x+i*y; % комплексный гауссовый шум для каждой выборки(вектор-столбец)
        Z_tr = z'; % транспонированный вектор z (вектор-строка)
        P = z*Z_tr; % произведение вектора-столбца на вектор-строку
        % результат - матрица M x M
        A = A + P; % матрица А (результат сложения всех произведений Р)
        % результат - матрица M x M
    end

    % рассчет ковариационной матрицы
    B = A ./ N;
    % disp ('Ковариационная матрица:');
    % disp (B);

    % считаем числитель Ch для GLR-статистики
    D = det(A); % вычисляем детерминант матрицы А
    Ch = D.^N;

    % считаем знаменатель для GLR-статистики
    Pm = 1;
    for i = 1:1:M
        Pm = Pm .* ((A(i,i)).^N);
    end
    % disp (Pm);

    % вычисляем GLR-статистику
    GLR = Ch ./ Pm;
    % disp ('Значение отношения правдоподобия:');
    % disp (GLR);

    % создаем вектор статистики для Q экспериментов
    L (q,1) = GLR;
    %  disp (L);
    
    % вычисляем и рассматриваем распределение модуля статистики
    GLR_abs = abs(GLR);
    L_abs (q,1) = GLR_abs;
    
    % вычисляем и рассматриваем распределение реальной части статистики
    % GLR_real = real(GLR);
    % L_real (q,1) = GLR_real;
    
end

t = 1:1:Q;
[m t] = hist(L_abs,r);
w = m/(Q*(t(2)-t(1))); % ФПВ
f = cumsum(m/Q); % интегральная ФПВ

figure
plot (t, w, t, f);
title ('График ФПВ и интегральной ФПВ');
legend ('PDF', 'CDF');
grid on;

figure
plot (t, w);
xlabel ('отношение правдоподобия');
ylabel ('ФПВ');
title ('График функции плотности вероятности');
grid on;

figure
plot (t, f);
xlabel ('отношение правдоподобия');
ylabel ('интегральная ФПВ');
title ('График интегральной функции плотности вероятности');
grid on;

figure
plot (L_abs);
xlabel ('номер эксперимента');
ylabel ('значение отношения правдоподобия');
title ('Модуль отношения правдоподобия');
grid on;

% figure
% plot (L_real);
% grid on;